; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared8 - mode
	image3 - mode
	infrared11 - mode
	spectrograph9 - mode
	thermograph2 - mode
	spectrograph10 - mode
	spectrograph1 - mode
	thermograph0 - mode
	image5 - mode
	spectrograph4 - mode
	infrared7 - mode
	spectrograph6 - mode
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star3 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image5)
	(supports instrument0 infrared7)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph9)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image3)
	(supports instrument1 image5)
	(supports instrument1 infrared8)
	(supports instrument1 spectrograph6)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared11)
	(supports instrument2 spectrograph4)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph10)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
)
(:goal (and
	(have_image Planet5 thermograph2)
	(have_image Planet5 image3)
	(have_image Star6 infrared8)
	(have_image Star6 infrared11)
	(have_image Planet7 spectrograph1)
	(have_image Planet7 spectrograph9)
	(have_image Planet7 spectrograph10)
	(have_image Planet7 infrared8)
	(have_image Star8 spectrograph6)
	(have_image Star8 image3)
	(have_image Phenomenon9 infrared7)
	(have_image Phenomenon9 infrared11)
	(have_image Phenomenon9 infrared8)
	(have_image Phenomenon9 thermograph0)
	(have_image Planet10 spectrograph1)
	(have_image Planet10 spectrograph4)
))

)

; plan
1. (turn_to satellite0 star3 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star3)
   goals met: 0 of 16
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 16
3. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 16
4. (turn_to satellite0 star8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star8)
   goals met: 0 of 16
5. (take_image satellite0 star8 instrument1 spectrograph6)
   added: (have_image star8 spectrograph6)
   goals met: 1 of 16
6. (take_image satellite0 star8 instrument1 image3)
   added: (have_image star8 image3)
   goals met: 2 of 16
7. (turn_to satellite0 star6 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star6)
   goals met: 2 of 16
8. (take_image satellite0 star6 instrument1 infrared8)
   added: (have_image star6 infrared8)
   goals met: 3 of 16
9. (turn_to satellite0 planet7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet7)
   goals met: 3 of 16
10. (take_image satellite0 planet7 instrument1 infrared8)
   added: (have_image planet7 infrared8)
   goals met: 4 of 16
11. (turn_to satellite0 planet5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet5)
   goals met: 4 of 16
12. (take_image satellite0 planet5 instrument1 image3)
   added: (have_image planet5 image3)
   goals met: 5 of 16
13. (turn_to satellite0 phenomenon9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 16
14. (take_image satellite0 phenomenon9 instrument1 infrared8)
   added: (have_image phenomenon9 infrared8)
   goals met: 6 of 16
15. (turn_to satellite0 groundstation0 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation0)
   goals met: 6 of 16
16. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 6 of 16
17. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 16
18. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 6 of 16
19. (turn_to satellite0 phenomenon9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 16
20. (take_image satellite0 phenomenon9 instrument0 infrared7)
   added: (have_image phenomenon9 infrared7)
   goals met: 7 of 16
21. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 7 of 16
22. (take_image satellite0 planet10 instrument0 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 8 of 16
23. (turn_to satellite0 planet5 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet5)
   goals met: 8 of 16
24. (take_image satellite0 planet5 instrument0 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 9 of 16
25. (turn_to satellite0 planet7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet7)
   goals met: 9 of 16
26. (take_image satellite0 planet7 instrument0 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 10 of 16
27. (take_image satellite0 planet7 instrument0 spectrograph9)
   added: (have_image planet7 spectrograph9)
   goals met: 11 of 16
28. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 11 of 16
29. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 11 of 16
30. (turn_to satellite0 star3 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star3)
   goals met: 11 of 16
31. (calibrate satellite0 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 11 of 16
32. (turn_to satellite0 phenomenon9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon9)
   goals met: 11 of 16
33. (take_image satellite0 phenomenon9 instrument2 infrared11)
   added: (have_image phenomenon9 infrared11)
   goals met: 12 of 16
34. (take_image satellite0 phenomenon9 instrument2 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 13 of 16
35. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 13 of 16
36. (take_image satellite0 planet10 instrument2 spectrograph4)
   added: (have_image planet10 spectrograph4)
   goals met: 14 of 16
37. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   goals met: 14 of 16
38. (take_image satellite0 planet7 instrument2 spectrograph10)
   added: (have_image planet7 spectrograph10)
   goals met: 15 of 16
39. (turn_to satellite0 star6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star6)
   goals met: 15 of 16
40. (take_image satellite0 star6 instrument2 infrared11)
   added: (have_image star6 infrared11)
   goals met: 16 of 16
